---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeInfo.#ctor(System.String)
source: html/c3c3c952-94f6-1a5a-c11e-b5fe8c2adf76.htm
---
# Autodesk.Revit.DB.ExportLinetypeInfo.#ctor Method

Constructs a new ExportLinetypeInfo using the destination linetype name as input.

## Syntax (C#)
```csharp
public ExportLinetypeInfo(
	string destinationLinetypeName
)
```

## Parameters
- **destinationLinetypeName** (`System.String`) - The destination line type name (the name of the linetype in the exported format).

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null